{"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 5000], "dtype": "float32", "bias_constraint": null, "name": "dense_1", "activation": "relu", "use_bias": true, "units": 512, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "activation": "sigmoid", "use_bias": true, "units": 256, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "use_bias": true, "units": 2, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.9", "class_name": "Sequential", "backend": "tensorflow"}